"""
Элементами множеств А, P и Q являются натуральные числа, причём
P = { 2, 4, 6, 8, 10, 12, 14, 16, 18, 20 } и
Q = { 3, 6, 9, 12, 15, 18, 21, 24, 27, 30 }.
Известно, что выражение
((x ∈ A) → ¬(x ∈ P)) ∧ (¬(x ∈ Q) → ¬(x ∈ A))
истинно (т. е. принимает значение 1) при любом значении переменной х.
Определите наибольшее возможное количество элементов множества A.
(Ответ: 7)
"""
def F( A, x ):
  return ((x in A) <= (x not in P)) and \
         ((x not in Q) <= (x not in A))

def valid( A ):
  return all( F(A, x) for x in range(1, 32) )

P = { 2, 4, 6, 8, 10, 12, 14, 16, 18, 20 }
Q = { 3, 6, 9, 12, 15, 18, 21, 24, 27, 30 }
A = set()
for a in P | Q:
  if valid( A|{a} ):
    A.add( a )
print( len(A), A )

