"""
У исполнителя Калькулятор имеются три команды, которым присвоены номера:
  1. Прибавь 1
  2. Прибавь 3
  3. Умножь на 2
Выполняя первую из них, исполнитель увеличивает число на экране на 1, выполняя
вторую – увеличивает на 3, выполняя третью – умножает число на 2.
Сколько существует программ, которые преобразуют число 1 в число 10 000, таких что
траектория вычислений (т. е. последовательность чисел, которую получает Калькулятор)
не включает число X = 7000 и включает число M = 3000?
В ответе запишите последние 6 цифр этого числа.
(Ответ: 507750)
"""
N = 10000
X = 7000
M = 3000

F = [0]*(N+1)
F[1] = 1
for i in range(2, M+1):
  F[i] = F[i-1] + F[i-3]
  if i % 2 == 0: F[i] += F[i//2]
  if i == X: F[i] = 0
  F[i] = F[i] % 1000000

for i in range(M+1, N+1):
  F[i] = F[i-1]
  if i >= M+3: F[i] += F[i-3]
  if i % 2 == 0 and i >= 2*M: F[i] += F[i//2]
  if i == X: F[i] = 0
  F[i] = F[i] % 1000000

#print( F )
print( F[N] )

print('-----------------------------------------')

F = [0]*(N+1)
F[1] = 1
for k, m in [(1, M), (M, N)]:
 for i in range(k+1, m+1):
  F[i] = F[i-1]
  if i >= k+3: F[i] += F[i-3]
  if i % 2 == 0 and i >= 2*k: F[i] += F[i//2]
  if i == X: F[i] = 0
  F[i] = F[i] % 1000000

#print( F )
print( F[N] )

print('-----------------------------------------')

F = [0]*(N+1)
F[1] = 1
for i in range(1, N+1):
  F[i] = F[i] % 1000000
  if i == X: F[i] = 0
  if (i-M)*(i+1-M) >= 0 and i+1 <= N:
    F[i+1] += F[i]
  if (i-M)*(i+3-M) >= 0 and i+3 <= N:
    F[i+3] += F[i]
  if (i-M)*(2*i-M) >= 0 and 2*i <= N:
    F[2*i] += F[i]

#print( F )
print( F[N] )

"""
from functools import cache
import sys
sys.setrecursionlimit( 3*N )
@cache
def f( start, end ):
  return 1 if start == end else \
         0 if start > end or start == X else \
         f( start+1, end ) + f( start+3, end ) + f( start*2, end )

print( f(1, M)*f(M, N) % 1000000 )
"""
