"""
У исполнителя Калькулятор имеются три команды, которым присвоены номера:
  1. Прибавь 1
  2. Прибавь 3
  3. Умножь на 2
Выполняя первую из них, исполнитель увеличивает число на экране на 1, выполняя
вторую – увеличивает на 3, выполняя третью – умножает число на 2.
Сколько существует программ, которые преобразуют число 1 в число 10 000?
В ответе запишите последние 6 цифр этого числа.
(Ответ: 759975)
"""
N = 10000

F = [0]*(N+1)
F[1] = 1
for i in range(2, N+1):
  F[i] = F[i-1] + F[i-3]
  if i % 2 == 0: F[i] += F[i//2]
  F[i] = F[i] % 1000000

#print( len(str(F[N])) )
print( F[N] )

print('-----------------------------------------')

F = [0]*(N+1)
F[1] = 1
for i in range(2, N+1):
  F[i] = F[i-1] + F[i-3] + \
         (F[i//2] if i % 2 == 0 else 0)
  F[i] = F[i] % 1000000

print( F[N] )

print('-----------------------------------------')

F = [0]*(N+1)
F[1] = 1
for i in range(1, N+1):
  F[i] = F[i] % 1000000
  if i+1 <= N: F[i+1] += F[i]
  if i+3 <= N: F[i+3] += F[i]
  if 2*i <= N: F[2*i] += F[i]

#print( F )
print( F[N] )

print('-----------------------------------------')

F = [0]*(2*N+1)
F[1] = 1
for i in range(1, N+1):
  F[i] = F[i] % 1000000
  F[i+1] += F[i]
  F[i+3] += F[i]
  F[2*i] += F[i]

#print( F )
print( F[N] )

"""
from functools import cache
import sys
sys.setrecursionlimit( 3*N )
@cache
def f( start, end ):
  return 1 if start == end else \
         0 if start > end else \
         f( start+1, end ) + f( start+3, end ) + f( start*2, end )

print( f(1, N) % 1000000 )
"""
