"""
На рисунке представлена схема дорог, связывающих города А, Б, В, Г, Д, Е,
Ж, З, И, К, Л, М. По каждой дороге можно двигаться только в одном направлении,
указанном стрелкой. Какова длина самого протяжённого пути из города А в город
М? Длиной пути считать количество дорог, составляющих этот путь.
"""
graph = { 'А': "БВ", 'Б': "ВГ", 'В': "Г", 'Г': "ДЕЗ",
          'Д': "ЕИ", 'Е': "ЖИК", 'Ж': "КЛ", 'З': "ЖЛ",
          'И': "КМ", 'К': "М", 'Л': "КМ" }

#s = 'АБВ БВГ ВГ ГДЕЗ ДЕИ ЕЖИК ЖКЛ ЗЖЛ ИКМ КМ ЛКМ'
#graph = { x[0]: x[1:] for x in s.split() }

def longestWay( way, end ):
  cur = way[-1]
  if cur == end:
    return 0
  maxLen = 0
  for nxt in graph[cur]:
    maxLen = max( longestWay(way+nxt, end), maxLen )
  return 1 + maxLen

print( longestWay('А', 'М') )

#-------------------------------------------

def longestWay( way, end ):
  if way[-1] == end:
    return 0
  return 1 + max( longestWay(way+nxt, end)
                  for nxt in graph[way[-1]] )

print( longestWay('А', 'М') )

#-------------------------------------------